David-EIPI/stm32-zigbee-light/firmware/STM32_WPAN/App/app_zigbee.c
static struct zigbee_app_info zigbee_app_info;

/* USER CODE BEGIN PV */

/* NVM variables */

static unsigned int persistNumWrites = 0;

enum app_zigbee_recovery_state {
	APP_ZIGBEE_RECOVERY_BOOT,
	APP_ZIGBEE_RECOVERY_PERSIST_PENDING,
	APP_ZIGBEE_RECOVERY_JOINED,
	APP_ZIGBEE_RECOVERY_PROBE_PENDING,
	APP_ZIGBEE_RECOVERY_REJOIN_REQUESTED,
	APP_ZIGBEE_RECOVERY_REJOIN_PENDING,
	APP_ZIGBEE_RECOVERY_FRESH_JOIN_REQUESTED,
	APP_ZIGBEE_RECOVERY_FRESH_JOIN_PENDING,
	APP_ZIGBEE_RECOVERY_TC_REJOIN_REQUESTED,
	APP_ZIGBEE_RECOVERY_TC_REJOIN_PENDING,
};

enum app_zigbee_diag_event {
	APP_ZIGBEE_DIAG_NONE,
	APP_ZIGBEE_DIAG_PERSIST_ACCEPTED,
	APP_ZIGBEE_DIAG_PERSIST_COMPLETE,
	APP_ZIGBEE_DIAG_PERSIST_FAILED,
	APP_ZIGBEE_DIAG_LEAVE,
	APP_ZIGBEE_DIAG_NETWORK_STATUS,
	APP_ZIGBEE_DIAG_REJOIN_STARTED,
	APP_ZIGBEE_DIAG_REJOIN_COMPLETE,
	APP_ZIGBEE_DIAG_FRESH_JOIN_STARTED,
	APP_ZIGBEE_DIAG_FRESH_JOIN_COMPLETE,
	APP_ZIGBEE_DIAG_PROBE_STARTED,
	APP_ZIGBEE_DIAG_PROBE_COMPLETE,
	APP_ZIGBEE_DIAG_TC_REJOIN_STARTED,
	APP_ZIGBEE_DIAG_TC_REJOIN_COMPLETE,
};

struct app_zigbee_diag_record {
	uint32_t magic;
	uint32_t version;
	uint32_t sequence;
	uint32_t last_event;
	uint32_t last_status;
	uint32_t last_short_addr;
	uint32_t persist_failures;
	uint32_t leave_events;
	uint32_t network_status_events;
	uint32_t recovery_attempts;
	uint32_t successful_recoveries;
	uint32_t last_persist_status;
	uint32_t last_leave_short_addr;
	uint32_t last_network_status;
	uint32_t last_network_short_addr;
	uint32_t crc32;
};

static struct app_zigbee_diag_record zigbee_diag;
static enum app_zigbee_recovery_state recovery_state = APP_ZIGBEE_RECOVERY_BOOT;
static bool persist_record_present;
static bool persist_record_valid;
static bool nvm_ready;
static bool diag_dirty;
static bool persist_reference_valid;
static uint16_t persist_reference_words;
static unsigned int persistNumWordsWritten;
static uint8_t rejoin_attempts;
static uint8_t trust_center_rejoin_attempts;
static uint32_t last_trust_center_rejoin_tick;
static uint64_t local_extended_address;

/* cache in uninit RAM to store/retrieve persistent data */
union cache
{
  uint8_t  U8_data[ST_PERSIST_MAX_ALLOC_SZ];     // in bytes
  uint32_t U32_data[ST_PERSIST_MAX_ALLOC_SZ/4U]; // in U32 words
};

union cache cache_persistent_data;
union cache cache_diag_reference;


struct ZbZclClusterT * analog_clusters[SW6_ENDPOINT];
struct ZbZclClusterT * multistate_cluster;
struct ZbZclClusterT * binary_cluster_light_on;
struct ZbZclClusterT * binary_cluster_motion_detect;
struct ZbZclClusterT * binary_cluster_dusk_detect;

const char *opmode_state_text[] = {
		"Auto",
		"Full",
		"Dim",
		"Off"
};

struct analog_cluster_attr {
	float value;
	float minPresent, maxPresent;
	float step;
	char desc[16];
	enum analog_mode mode;
	uint16_t engUnit;
	uint16_t icon;
	int32_t *extSetting;
	void (*ext_setting_cb)(int32_t *value);
} analog_cluster_attrs[] = {
		{
				.mode = ANALOG_OUTPUT,
				.desc = "\x09" "Dim level",
				.value = 50.0,
				.minPresent = 1.0,
				.maxPresent = 100.0,
				.step = 1.0,
				.engUnit = ZCL_ENGINEERING_UNIT_PERCENT,
				.icon = ZCL_ANALOG_ICON_BRIGHTNESS_PERCENT,
				.extSetting = &dimLevel,
		},
		{
				.mode = ANALOG_OUTPUT,
				.desc = "\x0a" "Dusk level",
				.value = 70.0,
				.minPresent = 1.0,
				.maxPresent = 200.0,
				.step = 1.0,
				.engUnit = ZCL_ENGINEERING_UNIT_PERCENT,
				.icon = ZCL_ANALOG_ICON_BRIGHTNESS_PERCENT,
				.extSetting = &ambientThreshold,
		},
		{
				.mode = ANALOG_OUTPUT,
				.desc = "\x0d" "Motion detect",
				.value = 80.0,
				.minPresent = 0.0,
				.maxPresent = 100.0,
				.step = 1.0,
				.engUnit = ZCL_ENGINEERING_UNIT_PERCENT,
				.icon = ZCL_ANALOG_ICON_PERCENT,
				.extSetting = &motionSensitivity,
				.ext_setting_cb = update_motion_sensitivity,
		},
		{
				.mode = ANALOG_OUTPUT,
				.desc = "\x0c" "After motion",
				.value = 300.0,
				.minPresent = 0.0,
				.maxPresent = 2*3600.0,
				.step = 1.0,
				.engUnit = ZCL_ENGINEERING_UNIT_SECONDS,
				.icon = ZCL_ANALOG_ICON_TIMER,
				.extSetting = &motionLight,
		},
		{
				.mode = ANALOG_OUTPUT,
				.desc = "\x0c" "After dusk",
				.value = 0.0,
				.minPresent = 1.0,
				.maxPresent = 12*60.0,
				.step = 1.0,
				.engUnit = ZCL_ENGINEERING_UNIT_MINUTES,
				.icon = ZCL_ANALOG_ICON_TIMER,
				.extSetting = &nightLight,
		},
		{
				.mode = ANALOG_OUTPUT,
				.desc = "\x0d" "Phase correct",
				.value = -300,
				.minPresent = -10000.0,
				.maxPresent = 10000,
				.step = 1,
				.engUnit = ZCL_ENGINEERING_UNIT_MICROSECONDS,
				.icon = ZCL_ANALOG_ICON_TIMER,
				.extSetting = &phase_correction,
		},
};

/* Stored attributes' values */
static uint8_t lightState = 0;
static uint8_t motionState = 0;
static uint8_t duskState = 0;

/* Data block for NVM storage */
struct persistence_attrs_v1 {
	uint32_t struct_len;
	float analogValues[lengthof(analog_cluster_attrs)];
	uint32_t multistateValue;
};

struct persistence_attrs {
	uint32_t struct_len;
	uint32_t crc32;
	float analogValues[lengthof(analog_cluster_attrs)];
	uint32_t multistateValue;
};



/* USER CODE END PV */
/* Functions Definition ------------------------------------------------------*/

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_Init(void)
{
  SHCI_CmdStatus_t ZigbeeInitStatus;

  APP_DBG("APP_ZIGBEE_Init");

  /* Check the compatibility with the Coprocessor Wireless Firmware loaded */
  APP_ZIGBEE_CheckWirelessFirmwareInfo();

  /* Register cmdbuffer */
  APP_ZIGBEE_RegisterCmdBuffer(&ZigbeeOtCmdBuffer);

  /* Init config buffer and call TL_ZIGBEE_Init */
  APP_ZIGBEE_TL_INIT();

  /* Register task */
  /* Create the different tasks */
  UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_NOTIFY_FROM_M0_TO_M4, UTIL_SEQ_RFU, APP_ZIGBEE_ProcessNotifyM0ToM4);
  UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_REQUEST_FROM_M0_TO_M4, UTIL_SEQ_RFU, APP_ZIGBEE_ProcessRequestM0ToM4);

