David-EIPI/stm32-zigbee-light/firmware/STM32_WPAN/App/app_zigbee.c
  /* Task associated with network creation process */
  UTIL_SEQ_RegTask(1U << CFG_TASK_ZIGBEE_NETWORK_FORM, UTIL_SEQ_RFU, APP_ZIGBEE_NwkForm);

  /* USER CODE BEGIN APP_ZIGBEE_INIT */
//  UTIL_SEQ_RegTask(1U << CFG_TASK_ZIGBEE_NETWORK_REJOIN, UTIL_SEQ_RFU, APP_ZIGBEE_NwkRejoin);
  UTIL_SEQ_RegTask(1U << CFG_TASK_ZIGBEE_RECOVERY, UTIL_SEQ_RFU, APP_ZIGBEE_RecoveryTask);

  /* NVM Init */
#if CFG_NVM
  APP_ZIGBEE_NVM_Init();
#endif

  /* USER CODE END APP_ZIGBEE_INIT */

  /* Start the Zigbee on the CPU2 side */
  ZigbeeInitStatus = SHCI_C2_ZIGBEE_Init();
  /* Prevent unused argument(s) compilation warning */
  UNUSED(ZigbeeInitStatus);

  /* Initialize Zigbee stack layers */
  APP_ZIGBEE_StackLayersInit();

}

/**
 * @brief  Initialize Zigbee stack layers
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_StackLayersInit(void)
{
  APP_DBG("APP_ZIGBEE_StackLayersInit");

  zigbee_app_info.zb = ZbInit(0U, NULL, NULL);
  assert(zigbee_app_info.zb != NULL);

  /* Create the endpoint and cluster(s) */
  APP_ZIGBEE_ConfigEndpoints();

  /* USER CODE BEGIN APP_ZIGBEE_StackLayersInit */
  zigbee_app_info.join_status = (enum ZbStatusCodeT) 0x01; /* init to error status */
  APP_ZIGBEE_setup_filter();
  local_extended_address = ZbExtendedAddress(zigbee_app_info.zb);

  /* STEP 1 - TRY to START FROM PERSISTENCE */
  enum ZbStatusCodeT status;

  /* First we disable the persistent notification */
  ZbPersistNotifyRegister(zigbee_app_info.zb,NULL,NULL);

  /* Increase transmission power (to 3.7dbm). Default setting is 0. */
  ZbNwkIfSetTxPower(zigbee_app_info.zb, "wpan0", 6);
  enum ZbStatusCodeT res;

  /* Remove parent link strength threshold. This application does not transmit frequent data
   * and association happens faster when more nodes are available.  */
  uint32_t bdb_flags = 0;
  res = ZbBdbGetIndex(zigbee_app_info.zb, ZB_BDB_Flags, &bdb_flags, sizeof(bdb_flags), 0);
  if (ZB_STATUS_SUCCESS == res) {
	  bdb_flags |= ZB_BDB_FLAG_IGNORE_COST_DURING_JOIN;
	  (void)ZbBdbSetIndex(zigbee_app_info.zb, ZB_BDB_Flags, &bdb_flags, sizeof(bdb_flags), 0);
  }


  /* Call a startup from persistence */
#if CFG_NVM
#if (RESET_ZB_NWK)
  APP_ZIGBEE_persist_delete();
#endif
#endif

  status = APP_ZIGBEE_ZbStartupPersist(zigbee_app_info.zb);
  if(status == ZB_STATUS_SUCCESS)
  {
     /* The return value only means that CPU2 accepted the asynchronous request.
      * Network state is marked joined by APP_ZIGBEE_PersistCompleted_callback(). */
     APP_DBG("ZbStartupPersist: request accepted; waiting for completion");
     recovery_state = APP_ZIGBEE_RECOVERY_PERSIST_PENDING;
     zigbee_app_info.has_init = true;
     APP_ZIGBEE_diag_record(APP_ZIGBEE_DIAG_PERSIST_ACCEPTED, status, 0xffffU);
     return;
  }
  else
  {
       APP_DBG("ZbStartupPersist: request rejected with status: 0x%02x",status);
       if (persist_record_present) {
         APP_ZIGBEE_diag_record(APP_ZIGBEE_DIAG_PERSIST_FAILED, status, 0xffffU);
         APP_ZIGBEE_request_recovery(APP_ZIGBEE_DIAG_PERSIST_FAILED);
         zigbee_app_info.has_init = true;
         return;
       }
  }
  /* USER CODE END APP_ZIGBEE_StackLayersInit */

  /* Configure the joining parameters */
  zigbee_app_info.join_status = (enum ZbStatusCodeT) 0x01; /* init to error status */
  zigbee_app_info.join_delay = HAL_GetTick(); /* now */
  zigbee_app_info.startupControl = ZbStartTypeJoin;

  /* Initialization Complete */
  zigbee_app_info.has_init = true;

  /* run the task */
  UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_NETWORK_FORM, CFG_SCH_PRIO_0);
}

/**
 * @brief  Configure Zigbee application endpoints
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ConfigEndpoints(void)
{
  struct ZbApsmeAddEndpointReqT req;
  struct ZbApsmeAddEndpointConfT conf;

  memset(&req, 0, sizeof(req));

  /* Endpoint: SW1_ENDPOINT */
  req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
  req.deviceId = ZCL_DEVICE_LEVEL_OUTPUT;
  req.endpoint = SW1_ENDPOINT;
  ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);

  /* Temperature meas server */
  zigbee_app_info.temperature_meas_server_1 = ZbZclTempMeasServerAlloc(zigbee_app_info.zb, SW1_ENDPOINT, TEMP_MIN_1, TEMP_MAX_1, TEMP_TOLERANCE_1);
  assert(zigbee_app_info.temperature_meas_server_1 != NULL);
  ZbZclClusterEndpointRegister(zigbee_app_info.temperature_meas_server_1);
  /* Illuminance meas server */
  zigbee_app_info.illuminance_meas_server_1 = ZbZclIllumMeasServerAlloc(zigbee_app_info.zb, SW1_ENDPOINT, ILLUM_MIN_1, ILLUM_MAX_1);
  assert(zigbee_app_info.illuminance_meas_server_1 != NULL);
  ZbZclClusterEndpointRegister(zigbee_app_info.illuminance_meas_server_1);
  /* Endpoint: SW2_ENDPOINT */
  req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
  req.deviceId = ZCL_DEVICE_LEVEL_OUTPUT;
  req.endpoint = SW2_ENDPOINT;
  ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);

  /* Endpoint: SW3_ENDPOINT */
  req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
  req.deviceId = ZCL_DEVICE_LEVEL_OUTPUT;
  req.endpoint = SW3_ENDPOINT;
  ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);

  /* Endpoint: SW4_ENDPOINT */
  req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
  req.deviceId = ZCL_DEVICE_LEVEL_OUTPUT;
  req.endpoint = SW4_ENDPOINT;
  ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);

  /* Endpoint: SW5_ENDPOINT */
  req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
  req.deviceId = ZCL_DEVICE_LEVEL_OUTPUT;
  req.endpoint = SW5_ENDPOINT;
  ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);

  /* Endpoint: SW6_ENDPOINT */
  req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
  req.deviceId = ZCL_DEVICE_ONOFF_SWITCH;
  req.endpoint = SW6_ENDPOINT;
  ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);

