David-EIPI/stm32-zigbee-light/firmware/STM32_WPAN/App/app_zigbee.c
  /* USER CODE BEGIN CONFIG_ENDPOINT */
  struct zcl_msv_attr_callbacks_t cb = {
		  .msv_presentValue = multistate_presentValue_CB,
  };
  multistate_cluster = ZbZcl_msv_ServerAlloc(zigbee_app_info.zb, SW1_ENDPOINT, MULTISTATE_VALUE,
		  lengthof(opmode_state_text), opmode_state_text, &cb, NULL);
  assert(multistate_cluster != NULL);

  char *msv_desc = "\x09" "Operation";
  (void)ZbZclAttrStringWriteShort(multistate_cluster, ZCL_MULTISTATE_DESCRIPTION_ATTR, (uint8_t*)msv_desc);

  ZbZclClusterEndpointRegister(multistate_cluster);

  unsigned ep_idx;
  for (ep_idx = SW1_ENDPOINT; ep_idx <= SW6_ENDPOINT; ep_idx += 1) {
	  unsigned cl_idx = ep_idx - 1;
	  struct zcl_analog_attr_callbacks_t analog_cb = {
			  .read = NULL,
			  .write = analog_presentValue_CB,
	  };

	  analog_clusters[cl_idx] = ZbZcl_Analog_ServerAlloc(
			  zigbee_app_info.zb,
			  ep_idx,
			  analog_cluster_attrs[cl_idx].mode,
			  &analog_cluster_attrs[cl_idx].value,
			  &analog_cb,
			  &analog_cluster_attrs[cl_idx]);

	  assert(analog_clusters[cl_idx] != NULL);

	  (void)ZbZclAttrFloatWrite(analog_clusters[cl_idx], ZCL_ANALOG_PRESENT_VALUE_ATTR, analog_cluster_attrs[cl_idx].value);
	  (void)ZbZclAttrFloatWrite(analog_clusters[cl_idx], ZCL_ANALOG_MAX_PRESENT_ATTR, analog_cluster_attrs[cl_idx].maxPresent);
	  (void)ZbZclAttrFloatWrite(analog_clusters[cl_idx], ZCL_ANALOG_MIN_PRESENT_ATTR, analog_cluster_attrs[cl_idx].minPresent);
	  (void)ZbZclAttrFloatWrite(analog_clusters[cl_idx], ZCL_ANALOG_RESOLUTION_ATTR, analog_cluster_attrs[cl_idx].step);
	  (void)ZbZclAttrIntegerWrite(analog_clusters[cl_idx], ZCL_ANALOG_ENGINEERING_UNITS_ATTR, analog_cluster_attrs[cl_idx].engUnit);
	  (void)ZbZclAttrIntegerWrite(analog_clusters[cl_idx], ZCL_ANALOG_APPLICATION_TYPE_ATTR, analog_cluster_attrs[cl_idx].icon << 16);
	  (void)ZbZclAttrStringWriteShort(analog_clusters[cl_idx], ZCL_ANALOG_DESCRIPTION_ATTR, (uint8_t*)analog_cluster_attrs[cl_idx].desc);
	  ZbZclClusterEndpointRegister(analog_clusters[cl_idx]);
  }

  binary_cluster_light_on = ZbZcl_Binary_ServerAlloc(zigbee_app_info.zb, SW1_ENDPOINT, BINARY_SENSOR_INPUT,
		  &lightState, NULL, NULL);
  assert(binary_cluster_light_on != NULL);
  ZbZclClusterEndpointRegister(binary_cluster_light_on);

  uint8_t light_on_sensor_desc[] = "\x0b" "Light state";
  (void)ZbZclAttrStringWriteShort(binary_cluster_light_on, ZCL_BINARY_DESCRIPTION_ATTR, light_on_sensor_desc);


  binary_cluster_dusk_detect = ZbZcl_Binary_ServerAlloc(zigbee_app_info.zb, SW2_ENDPOINT, BINARY_SENSOR_INPUT,
		  &duskState, NULL, NULL);
  assert(binary_cluster_dusk_detect != NULL);

  ZbZclClusterEndpointRegister(binary_cluster_dusk_detect);

  uint8_t dusk_detect_sensor_desc[] = "\x0b" "Dusk detect";
  (void)ZbZclAttrStringWriteShort(binary_cluster_dusk_detect, ZCL_BINARY_DESCRIPTION_ATTR, dusk_detect_sensor_desc);

  binary_cluster_motion_detect = ZbZcl_Binary_ServerAlloc(zigbee_app_info.zb, SW3_ENDPOINT, BINARY_SENSOR_INPUT,
		  &motionState, NULL, NULL);
  assert(binary_cluster_motion_detect != NULL);

  uint8_t motion_detect_sensor_desc[] = "\x0d" "Motion detect";
  (void)ZbZclAttrStringWriteShort(binary_cluster_motion_detect, ZCL_BINARY_DESCRIPTION_ATTR, motion_detect_sensor_desc);

  ZbZclClusterEndpointRegister(binary_cluster_motion_detect);

#if (!USE_TRAILING_EDGE)
/* This section is disabled because the current triac control is not compatible with the trailing edge drive mode */
  binary_triac_mode_cluster = ZbZcl_Binary_ServerAlloc(zigbee_app_info.zb, SW1_ENDPOINT, BINARY_SENSOR_OUTPUT,
		  &trailing_edge, NULL, NULL);
  assert(binary_triac_mode_cluster != NULL);
  ZbZclClusterEndpointRegister(binary_triac_mode_cluster);

  uint8_t triac_mode_desc[] = "\x0d" "Trailing edge";
  (void)ZbZclAttrStringWriteShort(binary_triac_mode_cluster, ZCL_BINARY_DESCRIPTION_ATTR, triac_mode_desc);
#endif

  APP_ZIGBEE_ConfigBasic();
  set_default_attr_values();
  /* USER CODE END CONFIG_ENDPOINT */
}

/**
 * @brief  Handle Zigbee network forming and joining
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_NwkForm(void)
{
  if ((zigbee_app_info.join_status != ZB_STATUS_SUCCESS) && (HAL_GetTick() >= zigbee_app_info.join_delay))
  {
    struct ZbStartupT config;
    enum ZbStatusCodeT status;

    /* Configure Zigbee Logging */
    ZbSetLogging(zigbee_app_info.zb, ZB_LOG_MASK_LEVEL_5, NULL);

    /* Attempt to join a zigbee network */
    ZbStartupConfigGetProDefaults(&config);

    /* Set the centralized network */
    APP_DBG("Network config : APP_STARTUP_CENTRALIZED_ROUTER");
    config.startupControl = zigbee_app_info.startupControl;

    /* Using the default HA preconfigured Link Key */
    memcpy(config.security.preconfiguredLinkKey, sec_key_ha, ZB_SEC_KEYSIZE);

    config.channelList.count = 1;
    config.channelList.list[0].page = 0;
    config.channelList.list[0].channelMask = 1 << CHANNEL; /*Channel in use */

    /* Using ZbStartupWait (blocking) */
    status = ZbStartupWait(zigbee_app_info.zb, &config);

    APP_DBG("ZbStartup Callback (status = 0x%02x)", status);
    zigbee_app_info.join_status = status;

    if (status == ZB_STATUS_SUCCESS)
    {
      zigbee_app_info.join_delay = 0U;
      zigbee_app_info.init_after_join = true;
      APP_DBG("Startup done !\n");
      /* USER CODE BEGIN 0 */

#if CFG_NVM
      /* Register Persistent data change notification */
      ZbPersistNotifyRegister(zigbee_app_info.zb,APP_ZIGBEE_persist_notify_cb,NULL);
      /* Call the callback once here to save persistence data */
      APP_ZIGBEE_persist_notify_cb(zigbee_app_info.zb,NULL);
#endif
      recovery_state = APP_ZIGBEE_RECOVERY_JOINED;
      rejoin_attempts = 0U;
      APP_ZIGBEE_diag_record(APP_ZIGBEE_DIAG_FRESH_JOIN_COMPLETE, status, ZbShortAddress(zigbee_app_info.zb));
      zigbee_diag.successful_recoveries++;
      diag_dirty = true;
      UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_RECOVERY, CFG_SCH_PRIO_0);
      ZbZclAttrReportKick(multistate_cluster, true, NULL, NULL);
      /* Use an absolute value. Multiplying the current value after every
       * recovery caused exponential growth and eventual integer overflow. */
      uint32_t pers_tm = APP_ZIGBEE_PERSIST_TIMEOUT_MS;
      (void)ZbBdbSetIndex(zigbee_app_info.zb, ZB_BDB_PersistTimeoutMs,
		      &pers_tm, sizeof(pers_tm), 0);

