David-EIPI/stm32-zigbee-light/firmware/STM32_WPAN/App/app_zigbee.c
static struct my_zb_app_data {
	struct ZbNlmeNetworkStatusIndT status;
} my_zb_app_data;

static void APP_ZIGBEE_setup_filter(void)
{
	/* callback initialization */

	struct ZigBeeT *zb = zigbee_app_info.zb;
	struct ZbMsgFilterT *filter = ZbMsgFilterRegister(zb,
			ZB_MSG_FILTER_LEAVE_IND | ZB_MSG_FILTER_STATUS_IND,
			ZB_MSG_DEFAULT_PRIO, app_msg_filter_callback, &my_zb_app_data);
	if (filter == NULL) {
		APP_DBG("Failed to register Zigbee network event filter");
	}
}

static void APP_ZIGBEE_RejoinCompleted_callback(struct ZbNlmeJoinConfT *conf, void *arg)
{
	APP_ZIGBEE_diag_record(APP_ZIGBEE_DIAG_REJOIN_COMPLETE,
			(uint32_t)conf->status, conf->nwkAddr);

	if (conf->status == ZB_STATUS_SUCCESS) {
		zigbee_diag.successful_recoveries++;
		diag_dirty = true;
		/* Rejoin may update the parent, short address, or security counters.
		 * Commit that refreshed stack state before normal notifications resume. */
		(void)APP_ZIGBEE_persist_save();
		APP_ZIGBEE_mark_joined();
		return;
	}

	if (rejoin_attempts < APP_ZIGBEE_REJOIN_ATTEMPTS_MAX) {
		/* Retry without resetting: ZbStartupRejoin is only valid while the stack
		 * still considers itself connected to the restored network. */
		recovery_state = APP_ZIGBEE_RECOVERY_REJOIN_REQUESTED;
	}
	else {
		/* A failed reachability repair must not strand an already commissioned
		 * router in fresh-join mode while permit-join is closed. Keep credentials
		 * and the restored stack state; later traffic or a reboot can recover it. */
		APP_ZIGBEE_mark_joined();
	}
	UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_RECOVERY, CFG_SCH_PRIO_0);
}

static void APP_ZIGBEE_TrustCenterRejoinCompleted_callback(enum ZbStatusCodeT status, void *arg)
{
	UNUSED(arg);
	last_trust_center_rejoin_tick = HAL_GetTick();
	APP_ZIGBEE_diag_record(APP_ZIGBEE_DIAG_TC_REJOIN_COMPLETE,
			(uint32_t)status, ZbShortAddress(zigbee_app_info.zb));

	if (status == ZB_STATUS_SUCCESS) {
		zigbee_diag.successful_recoveries++;
		(void)APP_ZIGBEE_persist_save();
		APP_ZIGBEE_mark_joined();
	}
	else {
		/* Preserve the current network and allow another security repair only
		 * after the cooldown. Never turn a key mismatch into a factory reset. */
		recovery_state = APP_ZIGBEE_RECOVERY_JOINED;
		zigbee_app_info.join_status = ZB_STATUS_SUCCESS;
	}
}

static void APP_ZIGBEE_RecoveryTask(void)
{
	enum ZbStatusCodeT status;

	if (diag_dirty) {
		(void)APP_ZIGBEE_diag_save();
	}

	if (recovery_state == APP_ZIGBEE_RECOVERY_REJOIN_REQUESTED) {
		rejoin_attempts++;
		zigbee_diag.recovery_attempts++;
		APP_ZIGBEE_diag_record(APP_ZIGBEE_DIAG_REJOIN_STARTED,
				rejoin_attempts, 0xffffU);
		(void)ZbPersistNotifyRegister(zigbee_app_info.zb, NULL, NULL);
		zigbee_app_info.join_status = ZB_NWK_STATUS_NO_NETWORKS;

		status = ZbStartupRejoin(zigbee_app_info.zb,
				APP_ZIGBEE_RejoinCompleted_callback, NULL);
		if (status == ZB_STATUS_SUCCESS) {
			recovery_state = APP_ZIGBEE_RECOVERY_REJOIN_PENDING;
		}
		else if (rejoin_attempts < APP_ZIGBEE_REJOIN_ATTEMPTS_MAX) {
			APP_ZIGBEE_diag_record(APP_ZIGBEE_DIAG_REJOIN_COMPLETE,
					(uint32_t)status, 0xffffU);
			recovery_state = APP_ZIGBEE_RECOVERY_REJOIN_REQUESTED;
			UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_RECOVERY, CFG_SCH_PRIO_0);
		}
		else {
			APP_ZIGBEE_diag_record(APP_ZIGBEE_DIAG_REJOIN_COMPLETE,
					(uint32_t)status, 0xffffU);
			APP_ZIGBEE_mark_joined();
		}
	}
	else if (recovery_state == APP_ZIGBEE_RECOVERY_TC_REJOIN_REQUESTED) {
		trust_center_rejoin_attempts++;
		zigbee_diag.recovery_attempts++;
		APP_ZIGBEE_diag_record(APP_ZIGBEE_DIAG_TC_REJOIN_STARTED,
				trust_center_rejoin_attempts, ZB_NWK_ADDR_COORDINATOR);
		status = ZbTrustCenterRejoin(zigbee_app_info.zb,
				APP_ZIGBEE_TrustCenterRejoinCompleted_callback, NULL);
		if (status == ZB_STATUS_SUCCESS) {
			recovery_state = APP_ZIGBEE_RECOVERY_TC_REJOIN_PENDING;
		}
		else {
			APP_ZIGBEE_TrustCenterRejoinCompleted_callback(status, NULL);
		}
	}
	else if (recovery_state == APP_ZIGBEE_RECOVERY_FRESH_JOIN_REQUESTED) {
		/* This is a normal BDB join, not a factory reset. The saved record and
		 * diagnostics remain available until a successful join supersedes them. */
		APP_ZIGBEE_diag_record(APP_ZIGBEE_DIAG_FRESH_JOIN_STARTED, 0U, 0xffffU);
		ZbReset(zigbee_app_info.zb);
		zigbee_app_info.startupControl = ZbStartTypeJoin;
		zigbee_app_info.join_status = ZB_NWK_STATUS_NO_NETWORKS;
		zigbee_app_info.join_delay = HAL_GetTick() + APP_ZIGBEE_STARTUP_REJOIN_DELAY;
		recovery_state = APP_ZIGBEE_RECOVERY_FRESH_JOIN_PENDING;
		UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_NETWORK_FORM, CFG_SCH_PRIO_0);
	}

	if (diag_dirty) {
		(void)APP_ZIGBEE_diag_save();
	}
}


struct ZbStartupRejoinWaitInfo {
  bool active;
  enum ZbStatusCodeT status;
};

static void ZbStartupRejoinWaitCb(struct ZbNlmeJoinConfT *conf, void *cb_arg)
{
  struct ZbStartupRejoinWaitInfo *info = cb_arg;

  info->status = conf->status;
  info->active = false;
  UTIL_SEQ_SetEvt(EVENT_ZIGBEE_STARTUP_ENDED);
} /* ZbStartupWaitCb */

enum ZbStatusCodeT ZbStartupRejoinWait(struct ZigBeeT *zb)
{
  static struct ZbStartupRejoinWaitInfo info;
  enum ZbStatusCodeT status;

  memset(&info, 0, sizeof(struct ZbStartupRejoinWaitInfo));

  info.active = true;
  status = ZbStartupRejoin(zb, ZbStartupRejoinWaitCb, &info);
  if (status != ZB_STATUS_SUCCESS) {
    info.active = false;
    return status;
  }
  UTIL_SEQ_WaitEvt(EVENT_ZIGBEE_STARTUP_ENDED);
  status = info.status;
  return status;
} /* ZbStartupRejoinWait */


/**
 * @brief  Setup basic cluster attributes.
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ConfigBasic(void)
{
 	uint8_t mfr_str[] = MANUFACTURER_NAME;
 	ZbZclBasicWriteDirect(zigbee_app_info.zb, SW1_ENDPOINT,
 			ZCL_BASIC_ATTR_MFR_NAME, mfr_str, sizeof(mfr_str) - 1);

 	uint8_t model_str[] = MODEL_NAME;
 	ZbZclBasicWriteDirect(zigbee_app_info.zb, SW1_ENDPOINT,
 			ZCL_BASIC_ATTR_MODEL_NAME, model_str, sizeof(model_str) - 1);

