David-EIPI/stm32-zigbee-light/firmware/STM32_WPAN/App/app_zigbee.c
	uint8_t location_str[] = LOCATION;
	ZbZclBasicWriteDirect(zigbee_app_info.zb, SW1_ENDPOINT,
			ZCL_BASIC_ATTR_LOCATION, location_str, sizeof(location_str) - 1);

 	uint8_t power_source = 0x01; // single phase
 	ZbZclBasicWriteDirect(zigbee_app_info.zb, SW1_ENDPOINT,
 			ZCL_BASIC_ATTR_POWER_SOURCE, &power_source, 1);

 	uint8_t physical_env = 0x0c; // deck
 	ZbZclBasicWriteDirect(zigbee_app_info.zb, SW1_ENDPOINT,
 			ZCL_BASIC_ATTR_ENVIRONMENT, &physical_env, 1);
}

/**
 * @brief  Set default attribute values if not starting from persistence
 * @param  None
 * @retval None
 */
void set_default_attr_values(void)
{
	unsigned ep_idx;
	for (ep_idx = SW1_ENDPOINT; ep_idx <= SW6_ENDPOINT; ep_idx += 1) {
		unsigned cl_idx = ep_idx - 1;
		(void)ZbZclAttrFloatWrite(analog_clusters[cl_idx], ZCL_ANALOG_PRESENT_VALUE_ATTR, analog_cluster_attrs[cl_idx].value);
	}

	(void)ZbZclAttrIntegerWrite(multistate_cluster, ZCL_MULTISTATE_PRESENT_VALUE_ATTR, operationMode);
}


/**
 * @brief  Set global parameter in response to the changed attribute value
 * @param  New attribute value
 * @retval None
 */
static void multistate_set_mode(uint16_t opmode)
{
	if (opmode >= OP_AUTO && opmode <= OP_OFF) {
		operationMode = opmode;
	}

}

/**
 * @brief  Callback function for the MultistateValue cluster
 * @param  Pointer to the cluster data
 * @param  Pointer to the attribute data
 * @retval Zigbee cluster library Status code
 */
enum ZclStatusCodeT multistate_presentValue_CB(struct ZbZclClusterT *clusterPtr, struct ZbZclAttrCbInfoT *info)
{
	uint16_t attributeId = info->info->attributeId;
	uint8_t endpoint = clusterPtr->endpoint;

	if (attributeId == ZCL_MULTISTATE_PRESENT_VALUE_ATTR && endpoint == SW1_ENDPOINT ) {
			enum ZclStatusCodeT result = ZCL_STATUS_SUCCESS;
			enum ZclDataTypeT type;
			uint16_t opmode = ZbZclAttrIntegerRead(clusterPtr, attributeId, &type, &result);
			if (ZCL_STATUS_SUCCESS == result)
				multistate_set_mode(opmode);
	}
	return ZCL_STATUS_SUCCESS;
}

/**
 * @brief  Set global parameter in response to the changed attribute value. Converts float value to integer value.
 * @param  Pointer to the attribute description data
 * @retval None
 */
void update_analog_attr_setting(struct analog_cluster_attr *attr)
{
	if (attr->extSetting) {
		float step_cnt = attr->value / attr->step;
		step_cnt =	 attr->value < 0 ? step_cnt - 0.5 : step_cnt + 0.5;
		*attr->extSetting = (int32_t)step_cnt;
		if (attr->ext_setting_cb)
			attr->ext_setting_cb(attr->extSetting);
	}
}

/**
 * @brief  Set global parameter in response to the changed attribute value
 * @param  Pointer to the cluster data
 * @param  Pointer to the attribute data
 * @param  Callback argument (stores attribute description data)
 * @retval Zigbee cluster library Status code
 */
enum ZclStatusCodeT analog_presentValue_CB(struct ZbZclClusterT *clusterPtr, struct ZbZclAttrCbInfoT *info, void *arg)
{
	struct analog_cluster_attr *attr = (struct analog_cluster_attr *)arg;
	update_analog_attr_setting(attr);
	return ZCL_STATUS_SUCCESS;
}


/**
 * @brief  Update value attribute of the illuminance measurement cluster
 * @param  Illuminance measurement
 * @retval None
 */
void APP_ZIGBEE_update_illum(uint16_t illum)
{
	int ha_illum;
/*
 * We need to send 10000 * log10(I), and we have 10*log2(I) + 50, so convert here
 */
	ha_illum = ((int)illum - 50) * 301;
	if (ha_illum <= 0) ha_illum = 1;
	(void)ZbZclAttrIntegerWrite(zigbee_app_info.illuminance_meas_server_1, ZCL_ILLUM_MEAS_ATTR_MEAS_VAL, ha_illum);
}

/**
 * @brief  Update value attribute of the binary input cluster
 * @param  Light state
 * @retval None
 */
void APP_ZIGBEE_update_lightstate(uint16_t state)
{
	if ((0 == state) != (0 == lightState))
		(void)ZbZclAttrIntegerWrite(binary_cluster_light_on, ZCL_BINARY_PRESENT_VALUE_ATTR, state);
}

/**
 * @brief  Update value attribute of the binary input cluster
 * @param  Motion detect
 * @retval None
 */
void APP_ZIGBEE_update_motion_detect(uint16_t state)
{
	if ((0 == state) != (0 == motionState))
		(void)ZbZclAttrIntegerWrite(binary_cluster_motion_detect, ZCL_BINARY_PRESENT_VALUE_ATTR, state);
}

/**
 * @brief  Update value attribute of the binary input cluster
 * @param  Dusk detect
 * @retval None
 */
void APP_ZIGBEE_update_dusk_detect(uint16_t state)
{
	if ((0 == state) != (0 == duskState))
		(void)ZbZclAttrIntegerWrite(binary_cluster_dusk_detect, ZCL_BINARY_PRESENT_VALUE_ATTR, state);
}

/**
 * @brief  Update value attribute of the temperature sensor cluster
 * @param  Temperature C x 100
 * @retval None
 */
void APP_ZIGBEE_update_temperature(int16_t temp)
{
	(void)ZbZclAttrIntegerWrite(zigbee_app_info.temperature_meas_server_1, ZCL_TEMP_MEAS_ATTR_MEAS_VAL, temp);
}

static uint32_t APP_ZIGBEE_crc32_update(uint32_t crc, const void *data, size_t len)
{
	const uint8_t *bytes = data;

	while (len-- != 0U) {
		crc ^= *bytes++;
		for (unsigned bit = 0; bit < 8U; bit++) {
			crc = (crc >> 1) ^ ((crc & 1U) ? 0xedb88320UL : 0U);
		}
	}
	return crc;
}

static uint32_t APP_ZIGBEE_persist_crc(const uint8_t *stack_data, uint32_t stack_len,
		const struct persistence_attrs *attrs)
{
	struct persistence_attrs copy;
	uint32_t crc = 0xffffffffUL;

	/* The stack blob has byte granularity, so its footer is not necessarily
	 * word-aligned. Avoid compiler-generated LDM/STM instructions here. */
	memcpy(&copy, attrs, sizeof(copy));
	copy.crc32 = 0U;
	crc = APP_ZIGBEE_crc32_update(crc, stack_data, stack_len);
	crc = APP_ZIGBEE_crc32_update(crc, &copy, sizeof(copy));
	return ~crc;
}

static void APP_ZIGBEE_diag_record(uint32_t event, uint32_t status, uint16_t short_addr)
{
	bool persist_event = false;

	zigbee_diag.last_event = event;
	zigbee_diag.last_status = status;
	zigbee_diag.last_short_addr = short_addr;
	if (event == APP_ZIGBEE_DIAG_PERSIST_FAILED) {
		zigbee_diag.persist_failures++;
		zigbee_diag.last_persist_status = status;
		persist_event = true;
	}
	else if (event == APP_ZIGBEE_DIAG_LEAVE) {
		zigbee_diag.last_leave_short_addr = short_addr;
		persist_event = true;
	}
	else if (event == APP_ZIGBEE_DIAG_NETWORK_STATUS) {
		zigbee_diag.last_network_status = status;
		zigbee_diag.last_network_short_addr = short_addr;
	}
	else if ((event == APP_ZIGBEE_DIAG_REJOIN_STARTED) ||
			(event == APP_ZIGBEE_DIAG_REJOIN_COMPLETE) ||
			(event == APP_ZIGBEE_DIAG_FRESH_JOIN_STARTED) ||
			((event == APP_ZIGBEE_DIAG_FRESH_JOIN_COMPLETE) &&
			 (status == ZB_STATUS_SUCCESS)) ||
			((event == APP_ZIGBEE_DIAG_PROBE_COMPLETE) &&
			 (status != ZB_STATUS_SUCCESS)) ||
			(event == APP_ZIGBEE_DIAG_TC_REJOIN_STARTED) ||
			(event == APP_ZIGBEE_DIAG_TC_REJOIN_COMPLETE)) {
		persist_event = true;
	}

	/* Diagnostics are a crash-recovery breadcrumb, not a telemetry log. Routine
	 * status traffic and successful boots stay in RAM to avoid flash wear. */
	if (persist_event) {
		diag_dirty = true;
		UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_RECOVERY, CFG_SCH_PRIO_0);
	}
}

static bool APP_ZIGBEE_diag_load(void)
{
	struct app_zigbee_diag_record record;
	uint32_t *words = (uint32_t *)&record;

	_Static_assert(sizeof(record) == APP_ZIGBEE_DIAG_WORDS * sizeof(uint32_t),
			"Diagnostic record size must match reserved EEPROM words");

