David-EIPI/stm32-zigbee-light/firmware/STM32_WPAN/App/app_zigbee.c
	memset(&record, 0, sizeof(record));
	if (!nvm_ready) {
		return false;
	}
	for (uint16_t i = 0; i < APP_ZIGBEE_DIAG_WORDS; i++) {
		if (EE_Read(0, APP_ZIGBEE_DIAG_START_ADDR + i, &words[i]) != EE_OK) {
			return false;
		}
	}

	uint32_t stored_crc = record.crc32;
	record.crc32 = 0U;
	uint32_t crc = ~APP_ZIGBEE_crc32_update(0xffffffffUL, &record, sizeof(record));
	if ((record.magic != APP_ZIGBEE_DIAG_MAGIC) ||
			(record.version != APP_ZIGBEE_DIAG_VERSION) || (crc != stored_crc)) {
		return false;
	}

	record.crc32 = stored_crc;
	zigbee_diag = record;
	return true;
}

static bool APP_ZIGBEE_diag_save(void)
{
	uint32_t *words = (uint32_t *)&zigbee_diag;
	int status = EE_OK;

	if (!nvm_ready || !diag_dirty) {
		return !diag_dirty;
	}

	zigbee_diag.magic = APP_ZIGBEE_DIAG_MAGIC;
	zigbee_diag.version = APP_ZIGBEE_DIAG_VERSION;
	zigbee_diag.sequence++;
	zigbee_diag.crc32 = 0U;
	zigbee_diag.crc32 = ~APP_ZIGBEE_crc32_update(0xffffffffUL,
			&zigbee_diag, sizeof(zigbee_diag));

	/* Write CRC last. A reset during the preceding writes leaves a record whose
	 * old CRC cannot validate the mixed generation. */
	for (uint16_t i = 0; i < APP_ZIGBEE_DIAG_WORDS - 1U; i++) {
		status = EE_Write(0, APP_ZIGBEE_DIAG_START_ADDR + i, words[i]);
		if (status != EE_OK) {
			return false;
		}
	}
	status = EE_Write(0, APP_ZIGBEE_DIAG_START_ADDR + APP_ZIGBEE_DIAG_WORDS - 1U,
			words[APP_ZIGBEE_DIAG_WORDS - 1U]);
	if (status == EE_OK) {
		diag_dirty = false;
		return true;
	}
	return false;
}

static void APP_ZIGBEE_request_recovery(uint32_t event)
{
	if ((recovery_state == APP_ZIGBEE_RECOVERY_REJOIN_PENDING) ||
			(recovery_state == APP_ZIGBEE_RECOVERY_FRESH_JOIN_PENDING) ||
			(recovery_state == APP_ZIGBEE_RECOVERY_TC_REJOIN_PENDING)) {
		return;
	}
	rejoin_attempts = 0U;
	/* Without a successfully restored stack there is no usable network key to
	 * rejoin with. An explicit local leave likewise requires commissioning.
	 * Reachability-probe failures retain the restored network and use bounded
	 * in-network rejoin attempts. */
	if ((event == APP_ZIGBEE_DIAG_PERSIST_FAILED) ||
			(event == APP_ZIGBEE_DIAG_LEAVE)) {
		recovery_state = APP_ZIGBEE_RECOVERY_FRESH_JOIN_REQUESTED;
	}
	else {
		recovery_state = APP_ZIGBEE_RECOVERY_REJOIN_REQUESTED;
	}
	UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_RECOVERY, CFG_SCH_PRIO_0);
}

static void APP_ZIGBEE_request_trust_center_rejoin(void)
{
	uint32_t now = HAL_GetTick();

	if ((recovery_state != APP_ZIGBEE_RECOVERY_JOINED) ||
			((last_trust_center_rejoin_tick != 0U) &&
			 ((uint32_t)(now - last_trust_center_rejoin_tick) <
					 APP_ZIGBEE_TC_REJOIN_COOLDOWN_MS))) {
		return;
	}
	trust_center_rejoin_attempts = 0U;
	recovery_state = APP_ZIGBEE_RECOVERY_TC_REJOIN_REQUESTED;
	APP_ZIGBEE_diag_record(APP_ZIGBEE_DIAG_NETWORK_STATUS,
			ZB_NWK_STATUS_CODE_BAD_KEY_SEQNUM, ZB_NWK_ADDR_COORDINATOR);
	UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_RECOVERY, CFG_SCH_PRIO_0);
}

static void APP_ZIGBEE_mark_joined(void)
{
	uint32_t pers_tm = APP_ZIGBEE_PERSIST_TIMEOUT_MS;

	recovery_state = APP_ZIGBEE_RECOVERY_JOINED;
	rejoin_attempts = 0U;
	trust_center_rejoin_attempts = 0U;
	zigbee_app_info.join_status = ZB_STATUS_SUCCESS;
	zigbee_app_info.join_delay = 0U;
	zigbee_app_info.init_after_join = true;
	set_default_attr_values();
	(void)ZbPersistNotifyRegister(zigbee_app_info.zb, APP_ZIGBEE_persist_notify_cb, NULL);
	(void)ZbBdbSetIndex(zigbee_app_info.zb, ZB_BDB_PersistTimeoutMs,
			&pers_tm, sizeof(pers_tm), 0);
	ZbZclAttrReportKick(multistate_cluster, true, NULL, NULL);
}

static void APP_ZIGBEE_CoordinatorProbeCompleted_callback(
		struct ZbZdoNodeDescRspT *rsp, void *arg)
{
	UNUSED(arg);
	APP_ZIGBEE_diag_record(APP_ZIGBEE_DIAG_PROBE_COMPLETE,
			(uint32_t)rsp->status, rsp->nwkAddr);

	/* A network event may already have started recovery while this ZDO
	 * transaction was outstanding. Do not let a late response undo it. */
	if (recovery_state != APP_ZIGBEE_RECOVERY_PROBE_PENDING) {
		return;
	}
	if (rsp->status == ZB_STATUS_SUCCESS) {
		recovery_state = APP_ZIGBEE_RECOVERY_JOINED;
		return;
	}

	APP_ZIGBEE_request_recovery(APP_ZIGBEE_DIAG_PROBE_COMPLETE);
}

static void APP_ZIGBEE_start_coordinator_probe(void)
{
	struct ZbZdoNodeDescReqT req = {
		.dstNwkAddr = ZB_NWK_ADDR_COORDINATOR,
		.nwkAddrOfInterest = ZB_NWK_ADDR_COORDINATOR,
	};
	enum ZbStatusCodeT status;

	recovery_state = APP_ZIGBEE_RECOVERY_PROBE_PENDING;
	APP_ZIGBEE_diag_record(APP_ZIGBEE_DIAG_PROBE_STARTED, 0U,
			ZB_NWK_ADDR_COORDINATOR);
	status = ZbZdoNodeDescReq(zigbee_app_info.zb, &req,
			APP_ZIGBEE_CoordinatorProbeCompleted_callback, NULL);
	if (status != ZB_STATUS_SUCCESS) {
		APP_ZIGBEE_diag_record(APP_ZIGBEE_DIAG_PROBE_COMPLETE,
				(uint32_t)status, ZB_NWK_ADDR_COORDINATOR);
		APP_ZIGBEE_request_recovery(APP_ZIGBEE_DIAG_PROBE_COMPLETE);
	}
}


/*************************************************************
 *
 * NVM FUNCTIONS
 *
 *************************************************************/
static void APP_ZIGBEE_pack_persist_values(struct persistence_attrs *persistence_attrs,
		const uint8_t *stack_data, uint32_t stack_len)
{
	struct persistence_attrs aligned = { 0 };

	aligned.struct_len = sizeof(aligned);

    unsigned n;
    for (n = 0; n < lengthof(analog_cluster_attrs); n++)
		aligned.analogValues[n] = analog_cluster_attrs[n].value;

	aligned.multistateValue = operationMode;
	aligned.crc32 = APP_ZIGBEE_persist_crc(stack_data, stack_len, &aligned);
	memcpy(persistence_attrs, &aligned, sizeof(aligned));
}

static void APP_ZIGBEE_unpack_persist_values(struct persistence_attrs *persistence_attrs)
{
	struct persistence_attrs aligned;

	memcpy(&aligned, persistence_attrs, sizeof(aligned));
	if (aligned.struct_len == sizeof(aligned)) {
		unsigned n;
		for (n = 0; n < lengthof(analog_cluster_attrs); n++)
			analog_cluster_attrs[n].value = aligned.analogValues[n];

