David-EIPI/stm32-zigbee-light/firmware/STM32_WPAN/App/app_zigbee.c
		operationMode = aligned.multistateValue;
	}
}

static void APP_ZIGBEE_unpack_persist_values_v1(const struct persistence_attrs_v1 *persistence_attrs)
{
	struct persistence_attrs_v1 aligned;

	memcpy(&aligned, persistence_attrs, sizeof(aligned));
	if (aligned.struct_len == sizeof(aligned)) {
		for (unsigned n = 0; n < lengthof(analog_cluster_attrs); n++) {
			analog_cluster_attrs[n].value = aligned.analogValues[n];
		}
		operationMode = aligned.multistateValue;
	}
}

/**
 * @brief  notify to save persistent data callback
 * @param  zb: Zigbee device object pointer, cbarg: callback arg pointer
 * @retval None
 */
static void APP_ZIGBEE_persist_notify_cb(struct ZigBeeT *zb, void *cbarg)
{
  APP_DBG("Notification to save persistent data requested from stack");
  /* Save the persistent data */
  APP_ZIGBEE_persist_save();
}

/**
 * @brief  Start Zigbee Network from persistent data
 * @param  zb: Zigbee device object pointer
 * @retval Zigbee stack Status code
 */
static enum ZbStatusCodeT APP_ZIGBEE_ZbStartupPersist(struct ZigBeeT* zb)
{
   bool read_status;
   enum ZbStatusCodeT status = ZB_STATUS_SUCCESS;

   /* Restore persistence */
   read_status = APP_ZIGBEE_persist_load();

   if (read_status)
   {
       /* Make sure the EPID is cleared, before we are allowed to restore persistence */
       uint64_t epid = 0U;
       ZbNwkSet(zb, ZB_NWK_NIB_ID_ExtendedPanId, &epid, sizeof(uint64_t));

       /* Start-up from persistence */
       APP_DBG("APP_ZIGBEE_ZbStartupPersist: restoring stack persistence");
       status = ZbStartupPersist(zb, &cache_persistent_data.U8_data[4], cache_persistent_data.U32_data[0],NULL,APP_ZIGBEE_PersistCompleted_callback,NULL);
   }
   else
   {
       /* Failed to restart from persistence */
       APP_DBG("APP_ZIGBEE_ZbStartupPersist: no persistence data to restore");
       status = ZB_STATUS_ALLOC_FAIL;
   }

   /* Only for debug purpose, depending of persistent data, following traces
      could display bytes that are irrelevants to on off cluster */
   if(status == ZB_STATUS_SUCCESS)
   {
     /* read the last bytes of data where the ZCL on off persistent data shall be*/
      uint32_t len = cache_persistent_data.U32_data[0] + 4 ;
      APP_DBG("ClusterID %02x %02x",cache_persistent_data.U8_data[len-9],cache_persistent_data.U8_data[len-10]);
      APP_DBG("Endpoint %02x %02x",cache_persistent_data.U8_data[len-7],cache_persistent_data.U8_data[len-8]);
      APP_DBG("Direction %02x",cache_persistent_data.U8_data[len-6]);
      APP_DBG("AttrID %02x %02x",cache_persistent_data.U8_data[len-4],cache_persistent_data.U8_data[len-5]);
      APP_DBG("Len %02x %02x",cache_persistent_data.U8_data[len-2],cache_persistent_data.U8_data[len-3]);
      APP_DBG("Value %02x",cache_persistent_data.U8_data[len-1]);
   }

   return status;
}/* APP_ZIGBEE_ZbStartupPersist */

/**
 * @brief  timer callback to wait end of restore cluster persistence form M0
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_PersistCompleted_callback(enum ZbStatusCodeT status,void *arg)
{
   if(status == ZB_WPAN_STATUS_SUCCESS)
   {
	   APP_DBG("Persist complete callback entered with SUCCESS");
	   APP_ZIGBEE_diag_record(APP_ZIGBEE_DIAG_PERSIST_COMPLETE,
			   (uint32_t)status, ZbShortAddress(zigbee_app_info.zb));
	   APP_ZIGBEE_mark_joined();
	   APP_ZIGBEE_start_coordinator_probe();
   }
   else
   {
	   APP_DBG("Error in persist complete callback %x",status);
	   APP_ZIGBEE_diag_record(APP_ZIGBEE_DIAG_PERSIST_FAILED,
			   (uint32_t)status, 0xffffU);
	   APP_ZIGBEE_request_recovery(APP_ZIGBEE_DIAG_PERSIST_FAILED);
   }
}/* APP_ZIGBEE_PersistCompleted_callback */


/**
 * @brief  Load persistent data
 * @param  None
 * @retval true if success, false if fail
 */
static bool APP_ZIGBEE_persist_load(void)
{
#ifdef CFG_NVM
    APP_DBG("Retrieving persistent data from FLASH");
    bool status = APP_ZIGBEE_NVM_Read();
	persist_record_present = status;
	persist_record_valid = false;

    if (status) {
		uint32_t total_len = cache_persistent_data.U32_data[0];

		if (total_len > sizeof(struct persistence_attrs)) {
			uint32_t stack_len = total_len - sizeof(struct persistence_attrs);
			const uint8_t *footer =
					&cache_persistent_data.U8_data[ST_PERSIST_FLASH_DATA_OFFSET + stack_len];
			struct persistence_attrs attrs;
			memcpy(&attrs, footer, sizeof(attrs));
			if ((attrs.struct_len == sizeof(attrs)) &&
					(attrs.crc32 == APP_ZIGBEE_persist_crc(
							&cache_persistent_data.U8_data[ST_PERSIST_FLASH_DATA_OFFSET],
							stack_len, &attrs))) {
				cache_persistent_data.U32_data[0] = stack_len;
				APP_ZIGBEE_unpack_persist_values(&attrs);
				persist_record_valid = true;
			}
		}

		/* Accept the previous footer format once, then convert it on the next save. */
		if (!persist_record_valid && (total_len > sizeof(struct persistence_attrs_v1))) {
			uint32_t stack_len = total_len - sizeof(struct persistence_attrs_v1);
			struct persistence_attrs_v1 attrs;
			memcpy(&attrs,
					&cache_persistent_data.U8_data[ST_PERSIST_FLASH_DATA_OFFSET + stack_len],
					sizeof(attrs));
			if (attrs.struct_len == sizeof(attrs)) {
				cache_persistent_data.U32_data[0] = stack_len;
				APP_ZIGBEE_unpack_persist_values_v1(&attrs);
				persist_record_valid = true;
			}
		}
    }
	if (persist_record_present && !persist_record_valid) {
		APP_DBG("Persistent data footer or CRC is invalid");
	}
    return persist_record_valid;
#else
    /* Check length range */
    if ((cache_persistent_data.U32_data[0] == 0) ||
        (cache_persistent_data.U32_data[0] > ST_PERSIST_MAX_ALLOC_SZ))
    {
        APP_DBG("No data or too large length : %d",cache_persistent_data.U32_data[0]);
        return false;
    }
    return true;
#endif /* CFG_NVM */
} /* APP_ZIGBEE_persist_load */

/**
 * @brief  Save persistent data
 * @param  None
 * @retval true if success , false if fail
 */
static bool APP_ZIGBEE_persist_save(void)
{
    uint32_t len;

    /* Clear the RAM cache before saving */
    memset(cache_persistent_data.U8_data, 0x00, ST_PERSIST_MAX_ALLOC_SZ);

