David-EIPI/stm32-zigbee-light/firmware/STM32_WPAN/App/app_zigbee.c
    num_words = 1U; /* 1 words for the length */
    num_words+= (uint16_t) (cache_persistent_data.U32_data[0]/4);


    /* Adjust the length to be U32 aligned */
    if (cache_persistent_data.U32_data[0] % 4 != 0)
    {
        num_words++;
    }

    /* Program data before the length/commit word. Compare against the RAM
     * shadow rather than calling EE_Read for every word: EE_Read scans the
     * append-only pool, while a RAM comparison is constant-time. Words beyond
     * the previous image length must be written even if the shadow happens to
     * contain the same value, because an older stale virtual value may exist. */
    for (local_current_size = 1U; local_current_size < num_words; local_current_size++)
    {
		if (persist_reference_valid &&
				(local_current_size < persist_reference_words) &&
				(cache_diag_reference.U32_data[local_current_size] ==
				 cache_persistent_data.U32_data[local_current_size])) {
			continue;
		}
        ee_status = EE_Write(0, (uint16_t)local_current_size + ZIGBEE_DB_START_ADDR, cache_persistent_data.U32_data[local_current_size]);
        if (ee_status != EE_OK)
        {
           if(ee_status == EE_CLEAN_NEEDED) /* Shall not be there if CFG_EE_AUTO_CLEAN = 1*/
           {
              APP_DBG("CLEAN NEEDED, CLEANING");
			  ee_status = EE_Clean(0,0);
           }
           if (ee_status != EE_OK)
           {
              APP_DBG("APP_ZIGBEE_NVM_Write failed @ %d status %d", local_current_size,ee_status);
              break;
           }
        }
		cache_diag_reference.U32_data[local_current_size] =
				cache_persistent_data.U32_data[local_current_size];
		words_written++;
    }

    if(ee_status != EE_OK)
    {
       APP_DBG("WRITE STOPPED, need a FLASH ERASE");
       return false;
    }

	/* Length is the commit word and is deliberately written last. */
	if (!persist_reference_valid ||
			(cache_diag_reference.U32_data[0] != cache_persistent_data.U32_data[0])) {
		ee_status = EE_Write(0, ZIGBEE_DB_START_ADDR,
				cache_persistent_data.U32_data[0]);
		if (ee_status == EE_CLEAN_NEEDED) {
			ee_status = EE_Clean(0, 0);
		}
		if (ee_status != EE_OK) {
			APP_DBG("APP_ZIGBEE_NVM_Write failed @ length status %d", ee_status);
			return false;
		}
		cache_diag_reference.U32_data[0] = cache_persistent_data.U32_data[0];
		words_written++;
	}

	persist_reference_words = num_words;
	persist_reference_valid = true;
	persistNumWordsWritten += words_written;

    APP_DBG("WRITTEN PERSISTENT DATA LEN = %d, changed words = %d, total words = %u",
			cache_persistent_data.U32_data[0], words_written, persistNumWordsWritten);
    return true;

} /* APP_ZIGBEE_NVM_Write */

/**
 * @brief  Erase the NVM
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_NVM_Erase(void)
{
   nvm_ready = (EE_Init(1, HW_FLASH_ADDRESS + CFG_NVM_BASE_ADDRESS) == EE_OK); /* Erase Flash */
	persist_reference_valid = false;
	persist_reference_words = 0U;
	memset(&zigbee_diag, 0, sizeof(zigbee_diag));
	zigbee_diag.magic = APP_ZIGBEE_DIAG_MAGIC;
	zigbee_diag.version = APP_ZIGBEE_DIAG_VERSION;
	diag_dirty = nvm_ready;
} /* APP_ZIGBEE_NVM_Erase */

#endif /* CFG_NVM */


static void zb_leave_cb(struct ZbNlmeLeaveConfT *conf, void *arg)
{
	struct zigbee_app_info *app = (struct zigbee_app_info *)arg;
	ZbReset(app->zb);

	/* Configure the joining parameters */
	zigbee_app_info.join_delay = HAL_GetTick(); /* now */
	zigbee_app_info.startupControl = ZbStartTypeJoin;

	/* attempt to reconnect */
	UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_NETWORK_FORM, CFG_SCH_PRIO_0);

}

void ZIGBEE_Leave(void)
{
	enum ZbStatusCodeT status =
			ZbLeaveReq(zigbee_app_info.zb, zb_leave_cb, &zigbee_app_info);

	zigbee_app_info.join_status = (enum ZbStatusCodeT) 0x01; /* init to error status */

	if (ZB_STATUS_SUCCESS == status) {
		APP_ZIGBEE_persist_delete();
	}
}

enum ZbStatusCodeT ZIGBEE_JoinStatus(void)
{
		return zigbee_app_info.join_status;
}

/* USER CODE END FD_LOCAL_FUNCTIONS */
